Revit 2024 API
ExternalService.IsRegisteredServerId Method
 Checks if the Id represents a valid server that has been registered for the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsRegisteredServerId(
	Guid serverId
)
Visual Basic
Public Function IsRegisteredServerId ( _
	serverId As Guid _
) As Boolean
Visual C++
public:
bool IsRegisteredServerId(
	Guid serverId
)
Parameters
serverId
Type: System.Guid
 An Id of a server
Return Value
 True if the specified server is currently registed for this service, false otherwise.
See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace